Былков_ДА_70180166/src/Documents/ПротоколЗаседанияКомиссии/ПротоколЗаседанияКомиссии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПротоколЗаседанияКомиссии</name>
  <basedOn>Document.РекомендацииПоСтудентам</basedOn>
  <registerRecords>AccumulationRegister.ДинамикаЛиквидацииЗадолженностей</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВозникшихЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛиквидированныхЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РекомендацииПоСтудентам</types>
      <types>DocumentRef</types>
    </type>
  </attributes>
</mdclass:Document>

Былков_ДА_70180166/src/AccumulationRegisters/ДинамикаЛиквидацииЗадолженностей/ДинамикаЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДинамикаЛиквидацииЗадолженностей</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоВозникшихЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЛиквидированныхЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Былков_ДА_70180166/src/Documents/ВедомостьУчетаАкадемическихЗадолженностей/ВедомостьУчетаАкадемическихЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьУчетаАкадемическихЗадолженностей</name>
  <basedOn>Document.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.СтатусыАкадемическихЗадолженностей</registerRecords>
  <registerRecords>AccumulationRegister.УчетАкадемическихЗадолженностей</registerRecords>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаКонтроля</name>
    <type>
      <types>EnumRef.ФормаКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>EnumRef.Оценка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусАкадемическойЗадолженности</name>
    <type>
      <types>EnumRef.НаименованиеСтатуса</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</types>
    </type>
  </attributes>
</mdclass:Document>

Былков_ДА_70180166/src/Documents/ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ/ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ</name>
  <basedOn>Document.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.СтатусыАкадемическихЗадолженностей</registerRecords>
  <registerRecords>AccumulationRegister.УчетАкадемическихЗадолженностей</registerRecords>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаКонтроля</name>
    <type>
      <types>EnumRef.ФормаКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>EnumRef.Оценка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусАкадемическойЗадолженности</name>
    <type>
      <types>EnumRef.НаименованиеСтатуса</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</types>
    </type>
  </attributes>
</mdclass:Document>

Былков_ДА_70180166/src/Documents/РекомендацииПоСтудентам/РекомендацииПоСтудентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РекомендацииПоСтудентам</name>
  <basedOn>Document.ВедомостьУчетаАкадемическихЗадолженностей</basedOn>
  <basedOn>Document.ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ</basedOn>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекомендация</name>
    <type>
      <types>EnumRef.РешениеКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ВедомостьУчетаАкадемическихЗадолженностей</types>
      <types>DocumentRef.ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ</types>
      <types>DocumentRef</types>
    </type>
  </attributes>
</mdclass:Document>

Былков_ДА_70180166/src/Catalogs/Студенты/Студенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Студенты</name>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтуденческийБилет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильСтудента</name>
    <type>
      <types>CatalogRef.ПрофилиПодготовкиСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>EnumRef.Курсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Былков_ДА_70180166/src/Documents/ПротоколЗаседанияКомиссии/ObjectModule.bsl
&НаСервере
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

    Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РекомендацииПоСтудентам") Тогда
        
        Группа = ДанныеЗаполнения.Группа;
        Студент = ДанныеЗаполнения.Студент;
        ДокументОснование = ДанныеЗаполнения.Ссылка; 
        // Проверяем, что все активные задолженности прошли этап "ВтораяПопытка"
        Если Не ВсеЗадолженностиПрошлиВторуюПопытку(Студент) Тогда
            ВызватьИсключение "Невозможно создать Протокол: не все активные задолженности прошли этап второй попытки!";
        КонецЕсли; 
        // Проверяем, что все ведомости имеют рекомендации
        Если Не ВсеВедомостиИмеютРекомендации(Студент) Тогда
            ВызватьИсключение "Невозможно создать Протокол: не по всем ведомостям созданы рекомендации!";
        КонецЕсли;
        // Проверяем вторую попытку (документ ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ)
        Если ВтораяПопытка(Студент) Тогда
            // Создаем Протокол на основании Рекомендаций
            НовыйПротокол = Документы.ПротоколЗаседанияКомиссии.СоздатьДокумент();
            НовыйПротокол.ДокументОснование = ДокументОснование;
            НовыйПротокол.Студент = Студент;
            НовыйПротокол.Группа = Группа;
            
            // Заполняем остальные реквизиты
            ЗаполнитьРеквизитыПротокола(НовыйПротокол, Студент);
                        
            // Открываем форму документа на клиенте
            ПараметрыОткрытия = Новый Структура("Объект", НовыйПротокол);
		           
        ИначеЕсли ЕстьАктивныеЗадолженности(Студент) Тогда
            ВызватьИсключение "Невозможно создать Протокол заседания комиссии: у студента имеются активные академические задолженности!";
        КонецЕсли;
               
        // Получаем данные студента из справочника
        ДанныеСтудента = ПолучитьДанныеСтудента(Студент);
        
        // Заполняем семестр
        Если ДанныеСтудента.Свойство("Семестр") Тогда
            ЭтотОбъект.Семестр = ДанныеСтудента.Семестр;
        КонецЕсли;
        
        // Проверяем наличие существующих протоколов
        ПроверитьНаличиеПротокола(Студент);
                   
        // Получаем количество возникших задолженностей
        КоличествоВозникших = ПолучитьКоличествоВозникшихЗадолженностей(Студент);
        ЭтотОбъект.КоличествоВозникшихЗадолженностей = КоличествоВозникших;
        
        // Получаем количество ликвидированных задолженностей
        КоличествоЛиквидированных = ПолучитьКоличествоЛиквидированныхЗадолженностей(Студент);
        ЭтотОбъект.КоличествоЛиквидированныхЗадолженностей = КоличествоЛиквидированных;
        
        // Рассчитываем процент задолженностей
        Если КоличествоВозникших > 0 Тогда
            ПроцентЗадолженностей = (КоличествоВозникших - КоличествоЛиквидированных) / КоличествоВозникших * 100;
            ЭтотОбъект.ПроцентЗадолженностей = Окр(ПроцентЗадолженностей, 2);
        Иначе
            ЭтотОбъект.ПроцентЗадолженностей = 0;
        КонецЕсли;
    КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВсеВедомостиИмеютРекомендации(Студент)
    
    // Получаем все ведомости для студента
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Ведомость.Ссылка КАК Ссылка
    |ИЗ
    |    Документ.ВедомостьУчетаАкадемическихЗадолженностей КАК Ведомость
    |ГДЕ
    |    Ведомость.Студент = &Студент
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |    ВедомостьИОМ.Ссылка КАК Ссылка
    |ИЗ
    |    Документ.ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ КАК ВедомостьИОМ
    |ГДЕ
    |    ВедомостьИОМ.Студент = &Студент";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Результат = Запрос.Выполнить();
    ВыборкаВедомостей = Результат.Выбрать();
    
    // Для каждой ведомости проверяем наличие рекомендаций
    Пока ВыборкаВедомостей.Следующий() Цикл
        ЗапросРекомендаций = Новый Запрос;
        ЗапросРекомендаций.Текст = 
        "ВЫБРАТЬ
        |    Рекомендации.Ссылка КАК Ссылка
        |ИЗ
        |    Документ.РекомендацииПоСтудентам КАК Рекомендации
        |ГДЕ
        |    Рекомендации.Студент = &Студент
        |    И Рекомендации.ДокументОснование = &ДокументОснование";
        
        ЗапросРекомендаций.УстановитьПараметр("Студент", Студент);
        ЗапросРекомендаций.УстановитьПараметр("ДокументОснование", ВыборкаВедомостей.Ссылка);
        РезультатРекомендаций = ЗапросРекомендаций.Выполнить();
        
        Если РезультатРекомендаций.Пустой() Тогда
            Возврат Ложь; // Найдена ведомость без рекомендаций
        КонецЕсли;
    КонецЦикла;
    
    Возврат Истина; // Все ведомости имеют рекомендации
КонецФункции

&НаСервере
Функция ВсеЗадолженностиПрошлиВторуюПопытку(Студент)
    
    // Получаем все активные задолженности
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ВедомостьУчетаАкадемическихЗадолженностей.Ссылка КАК Ссылка,
    |    ВедомостьУчетаАкадемическихЗадолженностей.Дисциплина КАК Дисциплина
    |ИЗ
    |    Документ.ВедомостьУчетаАкадемическихЗадолженностей КАК ВедомостьУчетаАкадемическихЗадолженностей
    |ГДЕ
    |    ВедомостьУчетаАкадемическихЗадолженностей.Студент = &Студент
    |    И ВедомостьУчетаАкадемическихЗадолженностей.СтатусАкадемическойЗадолженности = &АктивныйСтатус";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("АктивныйСтатус", Перечисления.НаименованиеСтатуса.Активная);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    // Для каждой активной задолженности проверяем наличие второй попытки
    Пока Выборка.Следующий() Цикл
        ЗапросПопытки = Новый Запрос;
        ЗапросПопытки.Текст = 
        "ВЫБРАТЬ
        |    ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Ссылка КАК Ссылка
        |ИЗ
        |    Документ.ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ КАК ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ
        |ГДЕ
        |    ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Студент = &Студент
        |    И ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Дисциплина = &Дисциплина";
        
        ЗапросПопытки.УстановитьПараметр("Студент", Студент);
        ЗапросПопытки.УстановитьПараметр("Дисциплина", Выборка.Дисциплина);
        РезультатПопытки = ЗапросПопытки.Выполнить();
        
        Если РезультатПопытки.Пустой() Тогда
            Возврат Ложь; // Найдена активная задолженность без второй попытки
        КонецЕсли;
    КонецЦикла;
    
    Возврат Истина; // Все активные задолженности имеют вторую попытку
КонецФункции

&НаСервере
Функция ВтораяПопытка(Студент)  
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Ссылка КАК Ссылка
    |ИЗ
    |    Документ.ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ КАК ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ
    |ГДЕ
    |    ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Студент = &Студент
    |    И ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.ПометкаУдаления = ЛОЖЬ";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Возврат Выборка.Количество() > 0;
    
КонецФункции

&НаСервере
Процедура ПроверитьНаличиеПротокола(Студент)
    
    Если ПустаяСтрока(Студент) Тогда
        ДанныеСтудента = ПолучитьДанныеСтудента(Студент);
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ПротоколЗаседанияКомиссии.Ссылка КАК Ссылка,
    |    ПротоколЗаседанияКомиссии.Дата КАК Дата,
    |    ПротоколЗаседанияКомиссии.Номер КАК Номер
    |ИЗ
    |    Документ.ПротоколЗаседанияКомиссии КАК ПротоколЗаседанияКомиссии
    |ГДЕ
    |    ПротоколЗаседанияКомиссии.Студент = &Студент
    |    И ПротоколЗаседанияКомиссии.ПометкаУдаления = ЛОЖЬ";

    Запрос.УстановитьПараметр("Студент", Студент);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

    Если Выборка.Количество() > 0 Тогда
       ВызватьИсключение("Для студента " + Студент + " уже существует «Протокол заседания комиссии»!");

    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПротокола(Протокол, Студент)
    
    ДанныеСтудента = ПолучитьДанныеСтудента(Студент);
    
    // Заполняем семестр
    Если ДанныеСтудента.Свойство("Семестр") Тогда
        Протокол.Семестр = ДанныеСтудента.Семестр;
    КонецЕсли;
    
    // Получаем количество задолженностей
    КоличествоВозникших = ПолучитьКоличествоВозникшихЗадолженностей(Студент);
    КоличествоЛиквидированных = ПолучитьКоличествоЛиквидированныхЗадолженностей(Студент);
    
    Протокол.КоличествоВозникшихЗадолженностей = КоличествоВозникших;
    Протокол.КоличествоЛиквидированныхЗадолженностей = КоличествоЛиквидированных;
    
    Если КоличествоВозникших > 0 Тогда
        ПроцентЗадолженностей = (КоличествоВозникших - КоличествоЛиквидированных) / КоличествоВозникших * 100;
        Протокол.ПроцентЗадолженностей = Окр(ПроцентЗадолженностей, 2);
    Иначе
        Протокол.ПроцентЗадолженностей = 0;
    КонецЕсли;
    
КонецПроцедуры
&НаСервере
Функция ЕстьАктивныеЗадолженности(Студент)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ВедомостьУчетаАкадемическихЗадолженностей.Ссылка КАК Ссылка
    |ИЗ
    |	Документ.ВедомостьУчетаАкадемическихЗадолженностей КАК ВедомостьУчетаАкадемическихЗадолженностей
    |ГДЕ
    |	ВедомостьУчетаАкадемическихЗадолженностей.Студент = &Студент
    |	И ВедомостьУчетаАкадемическихЗадолженностей.СтатусАкадемическойЗадолженности = &АктивныйСтатус";    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("АктивныйСтатус", Перечисления.НаименованиеСтатуса.Активная);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Возврат Выборка.Количество() > 0;
    
КонецФункции 
 
&НаСервере
Функция ПолучитьДанныеСтудента(СсылкаНаСтудента) Экспорт
    Результат = Новый Структура;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Студенты.Семестр КАК Семестр,
    |    Студенты.Группа,
    |    Студенты.ФормаОбучения КАК ФормаОбучения,
    |    Студенты.Наименование КАК Наименование
    |ИЗ
    |    Справочник.Студенты КАК Студенты
    |ГДЕ
    |    Студенты.Ссылка = &СсылкаНаСтудента"; 

    
    Запрос.УстановитьПараметр("СсылкаНаСтудента", СсылкаНаСтудента);
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();    

    Если Выборка.Следующий() Тогда
            Результат.Вставить("Семестр", Выборка.Семестр);                         
        	Результат.Вставить("ГруппаСсылка", Выборка.Группа);    
       	 	Результат.Вставить("НаименованиеСтудента", Выборка.Наименование);
        	Результат.Вставить("ФормаОбучения", Выборка.ФормаОбучения);
    КонецЕсли;

    Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьКоличествоВозникшихЗадолженностей(Студент)
    
    КоличествоЗадолженностей = 0;
    
    // Считаем все ведомости о задолженностях
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    КОЛИЧЕСТВО(Ведомость.Ссылка) КАК Количество
    |ИЗ
    |    Документ.ВедомостьУчетаАкадемическихЗадолженностей КАК Ведомость
    |ГДЕ
    |    Ведомость.Студент = &Студент";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    
    Попытка
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();
        Если Выборка.Следующий() Тогда
            КоличествоЗадолженностей = Выборка.Количество;
        КонецЕсли;
    Исключение
		
	КонецПопытки;
        
    Возврат ?(КоличествоЗадолженностей <> Неопределено, КоличествоЗадолженностей, 0);
КонецФункции

&НаСервере
Функция ПолучитьКоличествоЛиквидированныхЗадолженностей(Студент)
    
    КоличествоЛиквидированных = 0;
    
    // Считаем закрытые задолженности из ведомости
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    КОЛИЧЕСТВО(Ведомость.Ссылка) КАК Количество
    |ИЗ
    |    Документ.ВедомостьУчетаАкадемическихЗадолженностей КАК Ведомость
    |ГДЕ
    |    Ведомость.Студент = &Студент
    |    И Ведомость.СтатусАкадемическойЗадолженности = &СтатусЗакрыта";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("СтатусЗакрыта", Перечисления.НаименованиеСтатуса.Закрытая);
    
    Попытка
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();
        Если Выборка.Следующий() Тогда
            КоличествоЛиквидированных = Выборка.Количество;
        КонецЕсли;
    Исключение
		
	КонецПопытки;
    
    // Добавляем закрытые задолженности из ведомости для студентов с ИОМ
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    КОЛИЧЕСТВО(ВедомостьИОМ.Ссылка) КАК Количество
    |ИЗ
    |    Документ.ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ КАК ВедомостьИОМ
    |ГДЕ
    |    ВедомостьИОМ.Студент = &Студент
    |    И ВедомостьИОМ.СтатусАкадемическойЗадолженности = &СтатусЗакрыта";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("СтатусЗакрыта", Перечисления.НаименованиеСтатуса.Закрытая);
    
    Попытка
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();
        Если Выборка.Следующий() Тогда
            КоличествоЛиквидированных = КоличествоЛиквидированных + Выборка.Количество;
        КонецЕсли;
    Исключение
		
	КонецПопытки;
    
    Возврат ?(КоличествоЛиквидированных <> Неопределено, КоличествоЛиквидированных, 0);
КонецФункции

&НаСервере
Процедура ОбработкаПроведения(Отказ, Режим)
    
    // Регистр ДинамикаЛиквидацииЗадолженностей
    Движения.ДинамикаЛиквидацииЗадолженностей.Записывать = Истина;
    Движение = Движения.ДинамикаЛиквидацииЗадолженностей.Добавить();
    Движение.Период = Дата;
    Движение.Студент = ЭтотОбъект.Студент;
    Движение.Семестр = ЭтотОбъект.Семестр;
    Движение.КоличествоВозникшихЗадолженностей = ЭтотОбъект.КоличествоВозникшихЗадолженностей;
    Движение.КоличествоЛиквидированныхЗадолженностей = ЭтотОбъект.КоличествоЛиквидированныхЗадолженностей;
	
КонецПроцедуры
